import Link from "next/link";

export default function AboutPage() {
  return (
    <main>
      <h1>О проекте Cine-Vibe</h1>

      <section>
        <h2>Цель разработки</h2>
        <p>
          Создать веб-приложение, которое поможет пользователям быстро находить 
          фильмы по настроению и оригинальным интересам, а не по скучным жанрам. 
          Приложение должно решать проблему бесконечного выбора и экономить время 
          пользователей.
        </p>
      </section>

      <section>
        <h2>Будущий результат</h2>
        <p>
          К завершению курса приложение будет содержать несколько связанных страниц, 
          пользовательские сценарии (поиск, сохранение в избранное), работу с данными 
          и авторизацию. Пользователи смогут создавать свои коллекции фильмов и 
          получать персонализированные рекомендации.
        </p>
      </section>

      <section>
        <h2>Основная предметная сущность</h2>
        <p>
          <b>Фильм</b> — основная сущность приложения. Каждый фильм будет 
          содержать: название, год выпуска, режиссера, описание, жанры, ключевые 
          слова-настроения и постер.
        </p>
      </section>

      <section>
        <h2>Предполагаемые разделы приложения</h2>
        <ul>
          <li>главная страница с подборками по настроению;</li>
          <li>страница отдельного фильма с детальной информацией;</li>
          <li>личная коллекция (избранное и хочу посмотреть;);</li>
          <li>авторизация и регистрация.</li>          
          <li>о проекте;</li>
        </ul>
      </section>

      <Link className="main-link" href="/"> На главную </Link>
    </main>
  );
}
